'number' + 3 + 3 // number33 - конкатенація

null + 3 //3 - порожнє буде == 0

5 && "qwerty" // "qwerty" - з цим взагалі логіку спочаткку не зрозумів, що воно повертає останнє істене значення - моя голова поламана)

+'40' + +'2' + "hillel"; //42hillel - спочатку приведення до числа, їх додавання і потім конкатенація

'10' - 5 === 6; // false - спочатку преведення до чисел і віднімання - потім порівняння з типом даних, але значення різнв

true + false // 1 - переведення в 0+1

'4px' - 3 // NaN - '4px'- намагається привести в число

'4' - 3 // 1 - приведення в число

'6' + 3 ** 0; // "61" - 3 в 0 степерні == 1 і далі конкатенація

12 / '6' //2 - преведення до числа

'10' + (5 === 6); // 10false - спочатку в дужках строге порівняння, яке всеодно дає фалс, потім конкатенація

null == '' //  false - порожня строка не є null

3 ** (9 / 3); // 27 - ааа, тут просто втикнув - спочатку дія в дужка, потім в 3 степінь

!!'false' == !!'true' //true - провтикав, що там в лапка))) порівнняня двох не порожніс строк, непорожня строка == тру

0 || '0' && 1 //1 - 0 || '0' - звідси вибираємо '0' як тру, а далі остання тру - 1

(+null == false) < 1; //false - +null - переводиться в 0, далі порівняння, яке істине, істена переходить в 1 і порівнянн 1<1 - хибне

false && true || true //true - перша частина обирається тру, інша частина "І" теж дає тру

false && (false || true); //false - тут спочатку в дужках, тому фалс, і далі теж фалс

(+null == false) < 1 ** 5; //false - (+null == false) переходить в 0 == false, що є істиною, 1 в степені 5 - це всеодно 1, і маємо 1<1 - хибне
